Revit 2026 API
GeometryCreationUtilities.CreateRevolvedGeometry Method
Overload List
Name | Description
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double)
CreateRevolvedGeometry(Frame, IList<CurveLoop>, Double, Double, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace